{"fullName":"hed__Relationship_Auto_Create__c","customSettingsType":"List","description":"Automatically generates a Relationship between a Contact and another Contact or a Contact and a Contact/Campaign Member based on a custom lookup field.","enableFeeds":"false","fields":[{"fullName":"hed__Campaign_Types__c","deprecated":"false","description":"For Auto-Create Relationships based on Campaign Members, the list of Campaign types the automation applies to. This field will be blank for Auto-Create Relationships based on Contacts.","externalId":"false","inlineHelpText":"Eligible Campaign types for this Campaign Member auto-create. (Will be blank for Contact auto-create)","label":"Campaign Types","required":"false","trackTrending":"false","type":"TextArea"},{"fullName":"hed__Field__c","deprecated":"false","description":"The label of the lookup field that triggers the creation of this Relationship when the field value is updated.","externalId":"false","inlineHelpText":"The field insert or update that triggers the creation of this Relationship","label":"Field","length":"255","required":"false","trackTrending":"false","type":"Text","unique":"false"},{"fullName":"hed__Object__c","deprecated":"false","description":"The API name of the object (either Contact or CampaignMember) that the custom lookup field is on.","externalId":"false","inlineHelpText":"The object this Auto-Relationship is associated with","label":"Object","length":"50","required":"false","trackTrending":"false","type":"Text","unique":"false"},{"fullName":"hed__Relationship_Type__c","deprecated":"false","description":"The Relationship type (referer, family, etc.) to be created between the base object defined in the Object field, and the lookup object.","externalId":"false","inlineHelpText":"The Relationship type to be created between the base object and the lookup object.  The lookup object will receive the reciprocal Relationship, if one is available.","label":"Relationship Type","length":"255","required":"false","trackTrending":"false","type":"Text","unique":"false"}],"label":"Relationship Auto-Create","visibility":"Public"}